{"class_name": "Model", "config": {"name": "prediction_model", "layers": [{"name": "question_base", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 150], "dtype": "int32", "sparse": false, "ragged": false, "name": "question_base"}, "inbound_nodes": []}, {"name": "answer_good", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 150], "dtype": "int32", "sparse": false, "ragged": false, "name": "answer_good"}, "inbound_nodes": []}, {"name": "qa_model", "class_name": "Model", "config": {"name": "qa_model", "layers": [{"name": "question", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 150], "dtype": "int32", "sparse": false, "ragged": false, "name": "question"}, "inbound_nodes": []}, {"name": "answer", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 150], "dtype": "int32", "sparse": false, "ragged": false, "name": "answer"}, "inbound_nodes": []}, {"name": "question_embedding", "class_name": "Embedding", "config": {"name": "question_embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 34794, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null, "dtype": "float32"}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["question", 0, 0, {}]]]}, {"name": "answer_embedding", "class_name": "Embedding", "config": {"name": "answer_embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 34794, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null, "dtype": "float32"}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["answer", 0, 0, {}]]]}, {"name": "average", "class_name": "AverageLayer", "config": {"name": "average", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["question_embedding", 0, 0, {}]]]}, {"name": "attention", "class_name": "AttentionLayer", "config": {"name": "attention", "trainable": true, "dtype": "float32"}, "inbound_nodes": [[["answer_embedding", 0, 0, {}]]]}, {"name": "similarity", "class_name": "Lambda", "config": {"name": "similarity", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxYAAAB0AHwAZAEZAHwAZAIZAGQCZAONA1MAKQRO6QAAAADp\nAQAAACkB2gRheGlzKQHaEWNvc2luZV9zaW1pbGFyaXR5KQHaAXipAHIGAAAA+h8vY29udGVudC9j\nb25jcmEva2VyYXNfbW9kZWxzLnB52gg8bGFtYmRhPkwCAADzAAAAAA==\n", null, null], "function_type": "lambda", "module": "keras_models", "output_shape": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwQAAABkAlMAKQNO6QEAAAApAk5yAQAAAKkAKQHaAV9yAgAA\nAHICAAAA+h8vY29udGVudC9jb25jcmEva2VyYXNfbW9kZWxzLnB52gg8bGFtYmRhPk0CAADzAAAA\nAA==\n", null, null], "output_shape_type": "lambda", "output_shape_module": "keras_models", "arguments": {}}, "inbound_nodes": [[["average", 0, 0, {}], ["attention", 0, 0, {}]]]}], "input_layers": [["question", 0, 0], ["answer", 0, 0]], "output_layers": [["similarity", 0, 0]]}, "inbound_nodes": [[["question_base", 0, 0, {}], ["answer_good", 0, 0, {}]]]}], "input_layers": [["question_base", 0, 0], ["answer_good", 0, 0]], "output_layers": [["qa_model", 1, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}