{"class_name": "Model", "config": {"name": "prediction_model", "layers": [{"name": "question_base", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 150], "dtype": "int32", "sparse": false, "ragged": false, "name": "question_base"}, "inbound_nodes": []}, {"name": "answer_good", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 150], "dtype": "int32", "sparse": false, "ragged": false, "name": "answer_good"}, "inbound_nodes": []}, {"name": "qa_model", "class_name": "Model", "config": {"name": "qa_model", "layers": [{"name": "question", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 150], "dtype": "int32", "sparse": false, "ragged": false, "name": "question"}, "inbound_nodes": []}, {"name": "answer", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 150], "dtype": "int32", "sparse": false, "ragged": false, "name": "answer"}, "inbound_nodes": []}, {"name": "question_embedding", "class_name": "Embedding", "config": {"name": "question_embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 34794, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null, "dtype": "float32"}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["question", 0, 0, {}]]]}, {"name": "answer_embedding", "class_name": "Embedding", "config": {"name": "answer_embedding", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 34794, "output_dim": 100, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null, "dtype": "float32"}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}, "inbound_nodes": [[["answer", 0, 0, {}]]]}, {"name": "question_conv1d_with_bn_2", "class_name": "Conv1D", "config": {"name": "question_conv1d_with_bn_2", "trainable": true, "dtype": "float32", "filters": 1000, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["question_embedding", 0, 0, {}]]]}, {"name": "answer_conv1d_with_bn_2", "class_name": "Conv1D", "config": {"name": "answer_conv1d_with_bn_2", "trainable": true, "dtype": "float32", "filters": 1000, "kernel_size": [2], "strides": [1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null, "dtype": "float32"}}, "bias_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["answer_embedding", 0, 0, {}]]]}, {"name": "batch_normalization", "class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["question_conv1d_with_bn_2", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [2], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "gamma_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {"dtype": "float32"}}, "moving_variance_initializer": {"class_name": "Ones", "config": {"dtype": "float32"}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["answer_conv1d_with_bn_2", 0, 0, {}]]]}, {"name": "activation", "class_name": "Activation", "config": {"name": "activation", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "dtype": "float32", "activation": "relu"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "max", "class_name": "Lambda", "config": {"name": "max", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxAAAAB0AGoBfABkAWQCZAONA1MAKQRO6QEAAABGKQLaBGF4\naXPaCGtlZXBkaW1zKQLaAUvaA21heCkB2gF4qQByBwAAAPofL2NvbnRlbnQvY29uY3JhL2tlcmFz\nX21vZGVscy5wedoIPGxhbWJkYT7kAQAAcwAAAAA=\n", null, null], "function_type": "lambda", "module": "keras_models", "output_shape": ["4wEAAAAAAAAAAQAAAAMAAABTAAAAcxAAAAB8AGQBGQB8AGQCGQBmAlMAKQNO6QAAAADpAgAAAKkA\nKQHaAXhyAwAAAHIDAAAA+h8vY29udGVudC9jb25jcmEva2VyYXNfbW9kZWxzLnB52gg8bGFtYmRh\nPuQBAABzAAAAAA==\n", null, null], "output_shape_type": "lambda", "output_shape_module": "keras_models", "arguments": {}}, "inbound_nodes": [[["activation", 0, 0, {}]], [["activation_1", 0, 0, {}]]]}, {"name": "similarity", "class_name": "Lambda", "config": {"name": "similarity", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxYAAAB0AHwAZAEZAHwAZAIZAGQCZAONA1MAKQRO6QAAAADp\nAQAAACkB2gRheGlzKQHaEWNvc2luZV9zaW1pbGFyaXR5KQHaAXipAHIGAAAA+h8vY29udGVudC9j\nb25jcmEva2VyYXNfbW9kZWxzLnB52gg8bGFtYmRhPu8BAABzAAAAAA==\n", null, null], "function_type": "lambda", "module": "keras_models", "output_shape": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwQAAABkAlMAKQNO6QEAAAApAk5yAQAAAKkAKQHaAV9yAgAA\nAHICAAAA+h8vY29udGVudC9jb25jcmEva2VyYXNfbW9kZWxzLnB52gg8bGFtYmRhPvABAABzAAAA\nAA==\n", null, null], "output_shape_type": "lambda", "output_shape_module": "keras_models", "arguments": {}}, "inbound_nodes": [[["max", 0, 0, {}], ["max", 1, 0, {}]]]}], "input_layers": [["question", 0, 0], ["answer", 0, 0]], "output_layers": [["similarity", 0, 0]]}, "inbound_nodes": [[["question_base", 0, 0, {}], ["answer_good", 0, 0, {}]]]}], "input_layers": [["question_base", 0, 0], ["answer_good", 0, 0]], "output_layers": [["qa_model", 1, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}